Revit 2026 API

# RebarContainerAppendItemFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IListCurve, RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) Method

---

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainer.AppendItemFromCurves(RebarStyle style, RebarBarType barType, RebarHookType startHook, RebarHookType endHook, XYZ normal, IList<Curve> curves, RebarTerminationOrientation startHookOrient, RebarTerminationOrientation endHookOrient, bool useExistingShapeIfPossible, bool createNewShape) instead.")]
public RebarContainerItem AppendItemFromCurves(
	RebarStyle style,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ normal,
	IList<Curve> curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```vb
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainer.AppendItemFromCurves(RebarStyle style, RebarBarType barType, RebarHookType startHook, RebarHookType endHook, XYZ normal, IList<Curve> curves, RebarTerminationOrientation startHookOrient, RebarTerminationOrientation endHookOrient, bool useExistingShapeIfPossible, bool createNewShape) instead.")>
Public Function AppendItemFromCurves (
	style As RebarStyle,
	barType As RebarBarType,
	startHook As RebarHookType,
	endHook As RebarHookType,
	normal As XYZ,
	curves As IList(Of Curve),
	startHookOrient As RebarHookOrientation,
	endHookOrient As RebarHookOrientation,
	useExistingShapeIfPossible As Boolean,
	createNewShape As Boolean
) As RebarContainerItem
```
```cpp
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainer.AppendItemFromCurves(RebarStyle style, RebarBarType barType, RebarHookType startHook, RebarHookType endHook, XYZ normal, IList<Curve> curves, RebarTerminationOrientation startHookOrient, RebarTerminationOrientation endHookOrient, bool useExistingShapeIfPossible, bool createNewShape) instead.")]
RebarContainerItem^ AppendItemFromCurves(
	RebarStyle style,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ normal,
	IList<Curve^>^ curves,
	RebarHookOrientation startHookOrient,
	RebarHookOrientation endHookOrient,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```fsharp
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use RebarContainer.AppendItemFromCurves(RebarStyle style, RebarBarType barType, RebarHookType startHook, RebarHookType endHook, XYZ normal, IList<Curve> curves, RebarTerminationOrientation startHookOrient, RebarTerminationOrientation endHookOrient, bool useExistingShapeIfPossible, bool createNewShape) instead.")>]
member AppendItemFromCurves :
        style : RebarStyle *
        barType : RebarBarType *
        startHook : RebarHookType *
        endHook : RebarHookType *
        normal : XYZ *
        curves : IList<Curve> *
        startHookOrient : RebarHookOrientation *
        endHookOrient : RebarHookOrientation *
        useExistingShapeIfPossible : bool *
        createNewShape : bool -> RebarContainerItem
```

#### Parameters

style RebarStyle

barType RebarBarType

startHook RebarHookType

endHook RebarHookType

normal XYZ

curves IListCurve

startHookOrient RebarHookOrientation

endHookOrient RebarHookOrientation

useExistingShapeIfPossible Boolean

createNewShape Boolean

#### Return Value

RebarContainerItem

#### Reference

RebarContainer Class

AppendItemFromCurves Overload

Autodesk.Revit.DB.Structure Namespace